{"name": "Utsab Barman", "headline": "Data Science, Machine Learning, NLP, Deep Learning, LLMs", "summary": "As a Senior Data Scientist at Elsevier, I developed end-to-end machine learning solutions and services that leverage state-of-the-art deep learning models and the AWS platform. My role involves the entire process, from training and evaluating models to their deployment, using tools such as SageMaker. I have 5+ years of professional experience in data science, as well as multiple years in academic research, which have enabled me to acquire a solid foundation in machine learning, NLP, and project management.\n\nI am responsible for working on projects from their inception to their delivery, collaborating closely with colleagues to define the scope and establish objectives and deliverables. I manage projects using JIRA, employing both KANBAN and Scrum methodologies. Some of the projects I have worked on include developing automated anti-money laundering solutions, decentralized NLP and ML modules, and explanatory equipment management systems. I have also contributed to several publications and a patent in the field of NLP and machine learning. I have excellent communication skills, which allow me to effectively explain complex concepts to non-technical stakeholders, and present findings in a clear and concise manner. I am excited to bring my unique blend of industry and academia to every endeavor I undertake, and to deliver actionable insights that drive informed decision-making and empower my team to achieve our technical goals.", "industryName": "Computer Software", "locationName": "Netherlands", "public_id": "utsabbarman", "experience": [], "education": "Education:\n- PhD in Computer Science from Dublin City University (2013-2018)\n   - Thesis: Processing of Code-mixed/language-mixed Social Media User Generated Content\n   - Description: Developed automatic natural language processing (NLP) pipelines for noisy multi-lingual social media content using neural networks and machine learning algorithms.\n\n- M-Tech in Computer Science from Jadavpur University, Kolkata (2010-2013)\n   - Dissertation: Sentiment Analysis Meets Information Retrieval\n   - Description: Built a search engine prototype for opinionated tweets, including a tweet crawler, sentiment classifier, and search engine with a user interface.\n\n- B-Tech in Computer Science & Engineering from West Bengal University of Technology (2004-2008)", "languages": "I am fluent in Bengali and Hindi, with native or bilingual proficiency. I am also highly proficient", "publications": "I have published several papers in the field of computational linguistics. Some of my notable publications include \"Nextgen aml: Distributed deep learning based language technologies to augment anti money laundering investigation\" published by the Association for Computational Linguistics in July 2018, and \"Part-of-speech Tagging of Code-mixed Social Media Content: Pipeline, Stacking and Joint Modelling\" published by the Association for Computational Linguistics in November 2016. I have also published papers on topics such as", "certifications": "I have obtained several certifications in the field of data science and machine learning. These certifications include:\n- Python for Data Science Essential Training from LinkedIn\n- PyTorch Essential Training: Deep Learning from LinkedIn\n- Accelerating TensorFlow with the Google Machine Learning Engine from LinkedIn\n- Docker for Data Scientists from LinkedIn\n- DevOps for Data Scientists from LinkedIn\n- Deploying Scalable Machine Learning for Data Science from LinkedIn\n- Introduction to AWS DeepLens from LinkedIn\n- Agile Software Development: Kanban", "honors": "I was awarded a three-year fully funded PhD Scholarship sponsored by CNGL (now ADAPT Centre) in September 2013. The scholarship was titled \"CNGL PhD Scholarship\" and was issued by https://www.adaptcentre.ie/."}